merise/mocodo/MCD_uml.puml
' Generated by Mocodo 4.1.2

@startuml "MCD"

!define Table(x) class "x" << (T,#c7eae5) >>
!define pk(x) <b>x</b>
hide methods
left to right direction
skinparam groupInheritance 2
skinparam lineThickness 2
skinparam lineColor #bf812d
skinparam backgroundColor #f5f5f5
skinparam classAttributeFontColor #000000
skinparam classAttributeFontName Monospaced
skinparam classAttributeFontSize 14
skinparam classBackgroundColor #c7eae5
skinparam classBorderColor #35978f
skinparam classBorderThickness 2
skinparam classFontColor #000000
skinparam classFontName Arial
skinparam classFontSize 18
skinparam classHeaderBackgroundColor #80cdc1

"Category" "1..*" --- "*" "Product": "ASSOCIATE"

Table("Product") {
    {field} + pk(nume_product)
    {field} + name
    {field} + quantity
    {field} + status
    {field} + created_at
    {field} + updated_at
}

"Product" "*" --- "*" "Order": "BE PART OF"
("Product", "Order") .. "BE PART OF"
Table("BE PART OF") {
    {field} + quantity
}

Table("Order") {
    {field} + pk(num_order)
    {field} + num_invoice
    {field} + status
    {field} + created_at
    {field} + updated_at
}

Table("Category") {
    {field} + pk(num_category)
    {field} + name
    {field} + created_at
    {field} + updated_at
}

"Tag" "*" --- "*" "Product": "COMBINE"

Table("Tag") {
    {field} + pk(num_tag)
    {field} + name
    {field} + created_at
    {field} + updated_at
}

"User" "1" --- "*" "Order": "PLACE AN"

Table("User") {
    {field} + pk(num_user)
    {field} + name
    {field} + password
    {field} + created_at
    {field} + updated_at
}

@enduml
